[
    {
        "name": "公冶长",
        "contents": [
            {
                "dialog": "子谓公冶长：“可妻也，虽在缧绁之中，非其罪也！”以其子妻之。",
                "translation": "孔子评价公冶长：“他是个可以结婚的人，虽然曾经身陷囹圄，但不是他的罪过！”于是把自己的女儿嫁给了他。",
                "theme": "公冶长篇"
            }
        ]
    },
    {
        "name": "南容",
        "contents": [
            {
                "dialog": "子谓南容：“邦有道不废；邦无道免于刑戮。”以其兄之子妻之。",
                "translation": "孔子评价南容：“国家有道时，他不会被废弃；国家无道时，他能免于刑罚。”于是把兄长的女儿嫁给了他。",
                "theme": "公冶长篇"
            }
        ]
    },
    {
        "name": "子贱",
        "contents": [
            {
                "dialog": "子谓子贱：“君子哉若人！鲁无君子者，斯焉取斯？”",
                "translation": "孔子评价子贱：“这个人真是君子啊！如果鲁国没有君子，他从哪里学到这些？”",
                "theme": "公冶长篇"
            }
        ]
    },
    {
        "name": "子贡",
        "contents": [
            {
                "dialog": "子贡问曰：“赐也何如？”子曰：“女器也。”曰：“何器也？”曰：“瑚琏也。”",
                "translation": "子贡问孔子：“我赐怎么样？”孔子说：“你是个器物。”子贡问：“是什么器物？”孔子答道：“你是宗庙里用的瑚琏。”",
                "theme": "公冶长篇"
            },
            {
                "dialog": "子谓子贡曰：“女与回也孰愈？”对曰：“赐也何敢望回？回也闻一以知十，赐也闻一以知二。”子曰：“弗如也，吾与女弗如也！”",
                "translation": "孔子问子贡：“你和颜回相比，谁更好？”子贡答道：“我哪敢和颜回相比？颜回听到一件事能推知十件事，我只能推知两件。”孔子说：“你不如他，我和你一样也不如他。”",
                "theme": "公冶长篇"
            },
            {
                "dialog": "子贡曰：“夫子之文章，可得而闻也；夫子之言性与天道，不可得而闻也。”",
                "translation": "子贡说：“夫子的文章，我还能听到；至于夫子论性与天道的言论，却很难听到了。”",
                "theme": "公冶长篇"
            }
        ]
    },
    {
        "name": "子路",
        "contents": [
            {
                "dialog": "子曰：“道不行，乘桴浮于海，从我者其由与？”子路闻之喜，子曰：“由也好勇过我，无所取材。”",
                "translation": "孔子说：“大道行不通，我就乘着木筏渡海而去，跟随我的人恐怕只有子路吧？”子路听了很高兴，孔子说：“子路的勇敢超过了我，但没有选择适合的才能。”",
                "theme": "公冶长篇"
            },
            {
                "dialog": "孟武伯问：“子路仁乎？”子曰：“不知也。”又问，子曰：“由也，千乘之国，可使治其赋也，不知其仁也。”",
                "translation": "孟武伯问：“子路有仁德吗？”孔子回答：“不知道。”孟武伯又问，孔子说：“子路可以治理千乘之国的赋税，但我不知道他是否有仁德。”",
                "theme": "公冶长篇"
            },
            {
                "dialog": "子曰：“吾未见刚者。”或对曰：“申枨。”子曰：“枨也欲，焉得刚？”",
                "translation": "孔子说：“我还没见过真正刚毅的人。”有人提到申枨，孔子说：“申枨有欲望，怎么能称得上刚毅呢？”",
                "theme": "公冶长篇"
            },
            {
                "dialog": "子路有闻，未之能行，唯恐有闻。",
                "translation": "子路听到道理后，还没来得及实践，就害怕自己没能做到。",
                "theme": "公冶长篇"
            }
        ]
    },
    {
        "name": "颜渊",
        "contents": [
            {
                "dialog": "颜渊、季路侍，子曰：“盍各言尔志？”子路曰：“愿车马衣轻裘，与朋友共，敝之而无憾。”颜渊曰：“愿无伐善，无施劳。”子路曰：“愿闻子之志。”子曰：“老者安之，朋友信之，少者怀之。”",
                "translation": "颜渊和子路在侍奉孔子，孔子说：“为什么不各自说说自己的志向？”子路说：“我愿意与朋友共享车马衣服，哪怕用坏了也不后悔。”颜渊说：“我愿意不夸耀自己的优点，也不施加自己的功劳。”子路问孔子的志向，孔子说：“我希望老年人得到安逸，朋友间互相信任，年轻人得到关怀。”",
                "theme": "公冶长篇"
            }
        ]
    }
]
