[
    {
        "name": "子路",
        "contents": [
            {
                "dialog": "子路问政，子曰：“先之，劳之。”请益，曰：“无倦。”",
                "translation": "子路问关于治理的问题，孔子回答说：“首先要先行其事，努力工作。”子路进一步询问，孔子说：“不要感到疲倦。”",
                "theme": "子路篇"
            },
            {
                "dialog": "子路曰：“卫君待子而为政，子将奚先？”子曰：“必也正名乎！”子路曰：“有是哉，子之迂也！奚其正？”子曰：“野哉由也！君子于其所不知，盖阙如也。名不正，则言不顺；言不顺，则事不成；事不成，则礼乐不兴；礼乐不兴，则刑罚不中；刑罚不中，则民无所措手足。故君子名之必可言也，言之必可行也。君子于其言，无所苟而已矣。”",
                "translation": "子路说：“卫国的君主对待治理，您将首先做什么？”孔子说：“必须要正名！”子路说：“这话有道理，但您显得有些迂腐！什么是正？”孔子说：“子路，你太狭隘了！君子在他所不知道的事情上，往往是有缺陷的。名不正，则言不顺；言不顺，则事不成；事不成，则礼乐不兴；礼乐不兴，则刑罚不中；刑罚不中，则民无所措手足。所以，君子的名称必须可以言说，言说的内容必须可以实行。君子在言语上，不应苟且。”",
                "theme": "子路篇"
            },
            {
                "dialog": "子路问曰：“何如斯可谓之士矣？”子曰：“切切偲偲，怡怡如也，可谓士矣。朋友切切偲偲，兄弟怡怡。”",
                "translation": "子路问：“什么样的人可以被称为士？”孔子回答说：“言行谨慎而不轻浮，待人和气而不急躁的人，可以被称为士。朋友之间要诚恳，兄弟之间要和睦。”",
                "theme": "子路篇"
            }
        ]
    },
    {
        "name": "樊迟",
        "contents": [
            {
                "dialog": "樊迟请学稼，子曰：“吾不如老农。”请学为圃，曰：“吾不如老圃。”樊迟出，子曰：“小人哉樊须也！上好礼，则民莫敢不敬；上好义，则民莫敢不服；上好信，则民莫敢不用情。夫如是，则四方之民襁负其子而至矣，焉用稼？”",
                "translation": "樊迟请求学习农业，孔子说：“我不如老农。”请求学习园艺，孔子说：“我不如老园艺师。”樊迟离开后，孔子说：“樊迟真是小人！如果上层领导重视礼节，那么百姓就不敢不敬；如果重视义理，那么百姓就不敢不服；如果重视诚信，那么百姓就不敢不用情感。这样的话，四方的百姓都会带着孩子来到这里，那还需要学习农业吗？”",
                "theme": "子路篇"
            },
            {
                "dialog": "樊迟问仁，子曰：“居处恭，执事敬，与人忠。虽之夷狄，不可弃也。”",
                "translation": "樊迟问什么是仁，孔子说：“处事要恭敬，做事要敬重他人，与人交往要忠诚。即使是异国他乡的人，也不能抛弃这些品德。”",
                "theme": "子路篇"
            }
        ]
    },
    {
        "name": "子贡",
        "contents": [
            {
                "dialog": "子贡问曰：“何如斯可谓之士矣？”子曰：“行己有耻，使于四方不辱君命，可谓士矣。”曰：“敢问其次。”曰：“宗族称孝焉，乡党称弟焉。”曰：“敢问其次。”曰：“言必信，行必果，硁硁然小人哉！抑亦可以为次矣。”曰：“今之从政者何如？”子曰：“噫！斗筲之人，何足算也！”",
                "translation": "子贡问：“什么样的人可以被称为士？”孔子说：“自身有羞耻心，能够使四方不辱君命的人，可以称为士。”子贡继续问：“其次是什么？”孔子说：“家族称孝，乡里称弟。”子贡再问：“再次是什么？”孔子说：“言必信，行必果。尽管小人也可以做到这些，但这是次要的。”子贡最后问：“现在从政的人如何？”孔子叹息说：“唉！那些小人物，怎么值得一提！”",
                "theme": "子路篇"
            },
            {
                "dialog": "子贡问曰：“乡人皆好之，何如？”子曰：“未可也。”“乡人皆恶之，何如？”子曰：“未可也。不如乡人之善者好之，其不善者恶之。”",
                "translation": "子贡问：“如果乡里的人都喜欢某个人，这样的人如何？”孔子说：“还不能确定。”子贡再问：“如果乡里的人都讨厌某个人，这样的人如何？”孔子说：“还不能确定。不如乡里的人中好的喜欢他，不好的讨厌他。”",
                "theme": "子路篇"
            }
        ]
    },
    {
        "name": "子夏",
        "contents": [
            {
                "dialog": "子夏为莒父宰，问政，子曰：“无欲速，无见小利。欲速则不达，见小利则大事不成。”",
                "translation": "子夏担任莒国的官员，问关于治理的问题，孔子说：“不要急于求成，也不要追求小利益。急于求成会导致无法实现目标，追求小利益则会导致大事无法完成。”",
                "theme": "子路篇"
            }
        ]
    },
    {
        "name": "冉有",
        "contents": [
            {
                "dialog": "子适卫，冉有仆，子曰：“庶矣哉！”冉有曰：“既庶矣，又何加焉？”曰：“富之。”曰：“既富矣，又何加焉？”曰：“教之。”",
                "translation": "孔子去卫国，冉有的仆人问道：“已经庶民了，还能如何？”孔子说：“使其富裕。”仆人问：“已经富裕了，还能如何？”孔子说：“教化他。”",
                "theme": "子路篇"
            }
        ]
    }
]
