[
    {
        "name": "子路",
        "contents": [
            {
                "dialog": "子路问政，子曰：“先之，劳之。”请益，曰：“无倦。”",
                "translation": "子路询问治理之道，孔子回答说：“优先处理，努力工作。”当问及进一步的建议时，孔子说：“要不倦地工作。”",
                "theme": "子路篇"
            },
            {
                "dialog": "子路曰：“卫君待子而为政，子将奚先？”子曰：“必也正名乎！”子路曰：“有是哉，子之迂也！奚其正？”子曰：“野哉由也！君子于其所不知，盖阙如也。名不正，则言不顺；言不顺，则事不成；事不成，则礼乐不兴；礼乐不兴，则刑罚不中；刑罚不中，则民无所措手足。故君子名之必可言也，言之必可行也。君子于其言，无所苟而已矣。”",
                "translation": "子路问：“如果卫国的君主依赖你治理，你会优先处理什么？”孔子回答：“首先要正名。”子路回应：“这真是如此吗？你真是太迂腐了！应当怎样正名呢？”孔子说：“你太简单了。君子对于自己不了解的事情，应当避开。如果名不正，言就不会顺畅；言不顺畅，事情就无法成功；事情不成功，礼乐就无法兴盛；礼乐不兴盛，刑罚就无法有效；刑罚无法有效，百姓就无所适从。因此，君子要确保名分正确，言语可行。”",
                "theme": "子路篇"
            },
            {
                "dialog": "子路问成人，子曰：“若臧武仲之知、公绰之不欲、卞庄子之勇、冉求之艺，文之以礼乐，亦可以为成人矣。”曰：“今之成人者何必然？见利思义，见危授命，久要不忘平生之言，亦可以为成人矣。”",
                "translation": "子路问如何成为成人，孔子说：“如果你有臧武仲的智慧、公绰的节欲、卞庄子的勇敢、冉求的技艺，并且用礼乐来修身，这样可以成为成人。”他又说：“对于今天的成人来说，应该看到利益时考虑义理，看到危险时愿意献身，长期不忘生平的言行，这样也可以成为成人。”",
                "theme": "宪问篇"
            },
            {
                "dialog": "子路问事君，子曰：“勿欺也，而犯之。”",
                "translation": "子路问如何事奉君主，孔子说：“不要欺骗他，但要纠正他。”",
                "theme": "宪问篇"
            }
        ]
    },
    {
        "name": "子贡",
        "contents": [
            {
                "dialog": "子贡问曰：“何如斯可谓之士矣？”子曰：“行己有耻，使于四方不辱君命，可谓士矣。”曰：“敢问其次。”曰：“宗族称孝焉，乡党称弟焉。”曰：“敢问其次。”曰：“言必信，行必果，硁硁然小人哉！抑亦可以为次矣。”",
                "translation": "子贡问：“什么样的人可以被称为士？”孔子说：“行为有羞耻感，被派往四方时不辱君命的人，可以称为士。”子贡又问：“其次是什么？”孔子说：“家庭中被称为孝顺，乡里被称为弟友的人。”子贡再问：“再其次呢？”孔子说：“言必信，行必果，即使显得有些小人气质，也可以算作其次了。”",
                "theme": "子路篇"
            },
            {
                "dialog": "子贡问曰：“乡人皆好之，何如？”子曰：“未可也。”“乡人皆恶之，何如？”子曰：“未可也。不如乡人之善者好之，其不善者恶之。”",
                "translation": "子贡问：“如果乡里的人都喜欢他，这说明什么？”孔子回答：“还不够。”子贡又问：“如果乡里的人都不喜欢他呢？”孔子说：“这也还不够。最好是乡里善良的人喜欢他，不善良的人不喜欢他。”",
                "theme": "宪问篇"
            },
            {
                "dialog": "子贡曰：“管仲非仁者与？桓公杀公子纠，不能死，又相之。”子曰：“管仲相桓公霸诸侯，一匡天下，民到于今受其赐。微管仲，吾其被发左衽矣。岂若匹夫匹妇之为谅也，自经于沟渎而莫之知也。”",
                "translation": "子贡说：“管仲难道不是仁者吗？齐桓公杀了公子纠，却没有因此死去，还继续辅佐他。”孔子回答：“管仲辅佐齐桓公霸主诸侯，统一天下，至今百姓仍受其恩惠。如果没有管仲，我早就受到了凌辱。这比起普通百姓的理解要高得多，他们自遭困厄而无人知晓。”",
                "theme": "宪问篇"
            }
        ]
    },
    {
        "name": "冉有",
        "contents": [
            {
                "dialog": "子适卫，冉有仆，子曰：“庶矣哉！”冉有曰：“既庶矣，又何加焉？”曰：“富之。”曰：“既富矣，又何加焉？”曰：“教之。”",
                "translation": "孔子到卫国，冉有伺候他。孔子说：“这人已经算是普通百姓了。”冉有问：“既然已经是普通百姓了，还有什么可加的吗？”孔子回答：“使他富有。”冉有再问：“既然已经富有了，还有什么可加的吗？”孔子说：“教育他。”",
                "theme": "子路篇"
            }
        ]
    },
    {
        "name": "南宫适",
        "contents": [
            {
                "dialog": "南宫适问于孔子曰：“羿善射，奡荡舟，俱不得其死然；禹、稷躬稼而有天下。”夫子不答。南宫适出，子曰：“君子哉若人！尚德哉若人！”",
                "translation": "南宫适问孔子：“羿善于射箭，奡善于荡舟，他们都没有因此而死；而禹和稷则通过耕作而得到天下。”孔子没有回答。南宫适离开后，孔子说：“这真是君子啊！他多么重视德行啊！”",
                "theme": "宪问篇"
            }
        ]
    },
    {
        "name": "公叔文子",
        "contents": [
            {
                "dialog": "子问公叔文子于公明贾曰：“信乎，夫子不言，不笑，不取乎？”公明贾对曰：“以告者过也。夫子时然后言，人不厌其言；乐然后笑，人不厌其笑；义然后取，人不厌其取。”子曰：“其然？岂其然乎？”",
                "translation": "孔子通过公明贾询问公叔文子：“他是不说话，不笑，也不接受礼物吗？”公明贾回答说：“这只是告发者的夸张。孔子在适当的时候才说话，人们不会厌倦他的言辞；在合适的时候才笑，人们不会厌倦他的笑容；在适当的时候才接受礼物，人们不会厌倦他的接受。”孔子说：“真的是这样吗？真的是这样吗？”",
                "theme": "宪问篇"
            }
        ]
    }
]
